app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Econ 1"], ["room_number", 21], ["created_at", "2020-03-18 03:02:51.174787"], ["updated_at", "2020-03-18 03:02:51.174787"]]
---
    def create
        @school_class = SchoolClass.new
        @school_class.update(params.require(:school_class).permit(:title, :room_number))
        @school_class.save