app/controllers/students_controller.rb

    def create
        @student = Student.new
        @student.update(params.require(:student).permit(:first_name, :last_name))
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ryan"], ["last_name", "Seit"], ["created_at", "2020-03-18 03:03:33.413118"], ["updated_at", "2020-03-18 03:03:33.413118"]]